{
  "name": "Stono Ferry Golf Course",
  "ID": 0,
  "description": "Historic location on the Stono river with plenty of marsh.",
  "ranks": {
    "price": "$$",
    "handicapDifficulty": 9,
    "hazardDifficulty": 3,
    "merch": "D",
    "condition": "A",
    "enjoymentRating": "A",
    "vibe": "B",
    "range": "A",
    "amenities": "A",
    "glizzies": "F"
  },
  "overallRating": "A",
  "review": "The 1779 location of the Battle of Stono ferry - you’ll probably have a couple fallen soldiers (balls) as well while you’re playing around the river and all the ponds on the grounds. Pretty standard front nine through the neighborhoods and around the horse stable opens up to the signature back nine where the cannon and the river sit waiting. Having a few bad shots around the river and you may be looking at a 3 sleeve round - dont get too close to the ponds while looking for balls, the alligators might be lurking. Putting surface is pretty standard shapes with bermudagrass - one more slap in the face on 18 with the newer island green, hopefully you have a few more balls left to lose in this one last water feature. Sand beaches were nice and fluffy after the morning moisture burned off, some are weirdly shaped depending on the hole which adds a little spice to the mix.\n\nGenerally a really pleasant experience and the course is well maintained. \n\nVibe feels local, but slightly elevated. Its best to look nice here and have your manners ready - Stono Ferry feels like a respectable club and they’re definitely trying. Its semi-private though so the last group I was with didnt hesitate to rip 100 balls into the water and crack a few beers on hole 3 at 8:30 in the morning on a Thursday.\n\nMerch is kinda lacking, pretty standard stuff, logo isnt that cool.\n\nDecent sized grass range, sometimes they make you hit off the matts though, balls need to be paid for. Price is Standard\n\nI have not walked the course, but it feels like it would be a pretty good one, there is some elevation change, but not really that much all things considered, tee boxes are relatively close to the previous greens.\n\nPace of play is really not great at Stono Ferry - every time I’ve played it, its been around 4:30 and there e is always some waiting. Last time I was there we were the slow group, but the group in front of us took 10m to get through 2 shots on the first hole. Starter did come out and tell us to be quick at the turn when we were 5m over pace, actually did feel kind of warranted.\n\nBermudagrass greens. Conditions on the greens when I played were pretty bad honestly - they had just finished aerating the greens maybe 2 weeks before I played. I figured they would be ironed out  by now but they still had quite a few sand dimples and sometimes the putts were not rolling true. Overall I think I may have lost 3-4 strokes on the greens cause of their condition.\n\nStyle feels pretty resort-y, plenty of rough around the fairways for you to hit - decent amount of sand and water though.\n\nWater:\n\n- 9 holes have water that you need to pay attention to\n- 5 additional holes have water around them that you may actually end up in if you suck\n- 4 holes have creek/marsh slotted in them somewhere (can also have water above)\n\nSand:\n\n- 8 holes have sand that is untraditional (weird fairway and green bunkers)\n- 7 additional holes have more traditional sand (fairway bunkers on the edges, greenside bunkers)\n- I didnt see any alligators but I know they are there\n\n3 Sleeve difficulty (might lose 9 balls)\n\nGolf cart was one of the high-tech ones that tracks all your shit (which I didnt use) pretty annoying cause one time it told me I was out of bounds on the cart path so that brought it down a notch. \n\nI have not had great experience with the food at Stono - one time their kitchen was closed and they gave us some shitty boxed sandwiches as its all they had, I am still yearning for the glizzy.",
  "holes": [],
  "scores": [],
  "address": "4812 Stono Links Drive Hollywood, SC 29449"
}